; domain
(define (domain zeno-travel)
(:requirements :typing :fluents)
(:types aircraft person city - object)
(:predicates (at ?x - (either person aircraft) ?c - city)
             (in ?p - person ?a - aircraft))
(:functions (fuel ?a - aircraft)
            (distance ?c1 - city ?c2 - city)
            (slow-burn ?a - aircraft)
            (fast-burn ?a - aircraft)
            (capacity ?a - aircraft)
            (total-fuel-used)
	    (onboard ?a - aircraft)
            (zoom-limit ?a - aircraft)
            )


(:action board
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (at ?p ?c)
                 (at ?a ?c))
 :effect (and (not (at ?p ?c))
              (in ?p ?a)
		(increase (onboard ?a) 1)))


(:action debark
 :parameters (?p - person ?a - aircraft ?c - city)
 :precondition (and (in ?p ?a)
                 (at ?a ?c))
 :effect (and (not (in ?p ?a))
              (at ?p ?c)
		(decrease (onboard ?a) 1)))

(:action fly 
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a))))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (slow-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (slow-burn ?a)))))
                                  
(:action zoom
 :parameters (?a - aircraft ?c1 ?c2 - city)
 :precondition (and (at ?a ?c1)
                 (>= (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
                 (<= (onboard ?a) (zoom-limit ?a)))
 :effect (and (not (at ?a ?c1))
              (at ?a ?c2)
              (increase (total-fuel-used)
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
              (decrease (fuel ?a) 
                         (* (distance ?c1 ?c2) (fast-burn ?a)))
	)
) 

(:action refuel	
 :parameters (?a - aircraft ?c - city)
 :precondition (and (> (capacity ?a) (fuel ?a))
               (at ?a ?c)
		)
 :effect (and (assign (fuel ?a) (capacity ?a)))
)


)

; problem
(define (problem ZTRAVEL-5-6)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	plane4 - aircraft
	plane5 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	)
(:init
	(at plane1 city3)
	(= (capacity plane1) 3019)
	(= (fuel plane1) 11)
	(= (slow-burn plane1) 1)
	(= (fast-burn plane1) 2)
	(= (onboard plane1) 0)
	(= (zoom-limit plane1) 7)
	(at plane2 city7)
	(= (capacity plane2) 2175)
	(= (fuel plane2) 725)
	(= (slow-burn plane2) 1)
	(= (fast-burn plane2) 3)
	(= (onboard plane2) 0)
	(= (zoom-limit plane2) 7)
	(at plane3 city2)
	(= (capacity plane3) 11706)
	(= (fuel plane3) 4624)
	(= (slow-burn plane3) 5)
	(= (fast-burn plane3) 11)
	(= (onboard plane3) 0)
	(= (zoom-limit plane3) 3)
	(at plane4 city5)
	(= (capacity plane4) 10591)
	(= (fuel plane4) 4847)
	(= (slow-burn plane4) 5)
	(= (fast-burn plane4) 16)
	(= (onboard plane4) 0)
	(= (zoom-limit plane4) 7)
	(at plane5 city0)
	(= (capacity plane5) 13993)
	(= (fuel plane5) 4944)
	(= (slow-burn plane5) 5)
	(= (fast-burn plane5) 16)
	(= (onboard plane5) 0)
	(= (zoom-limit plane5) 5)
	(at person1 city6)
	(at person2 city0)
	(at person3 city4)
	(at person4 city1)
	(at person5 city6)
	(at person6 city4)
	(= (distance city0 city0) 0)
	(= (distance city0 city1) 931)
	(= (distance city0 city2) 622)
	(= (distance city0 city3) 917)
	(= (distance city0 city4) 596)
	(= (distance city0 city5) 534)
	(= (distance city0 city6) 642)
	(= (distance city0 city7) 606)
	(= (distance city1 city0) 931)
	(= (distance city1 city1) 0)
	(= (distance city1 city2) 899)
	(= (distance city1 city3) 855)
	(= (distance city1 city4) 950)
	(= (distance city1 city5) 622)
	(= (distance city1 city6) 909)
	(= (distance city1 city7) 570)
	(= (distance city2 city0) 622)
	(= (distance city2 city1) 899)
	(= (distance city2 city2) 0)
	(= (distance city2 city3) 975)
	(= (distance city2 city4) 912)
	(= (distance city2 city5) 504)
	(= (distance city2 city6) 986)
	(= (distance city2 city7) 562)
	(= (distance city3 city0) 917)
	(= (distance city3 city1) 855)
	(= (distance city3 city2) 975)
	(= (distance city3 city3) 0)
	(= (distance city3 city4) 770)
	(= (distance city3 city5) 648)
	(= (distance city3 city6) 604)
	(= (distance city3 city7) 761)
	(= (distance city4 city0) 596)
	(= (distance city4 city1) 950)
	(= (distance city4 city2) 912)
	(= (distance city4 city3) 770)
	(= (distance city4 city4) 0)
	(= (distance city4 city5) 661)
	(= (distance city4 city6) 515)
	(= (distance city4 city7) 720)
	(= (distance city5 city0) 534)
	(= (distance city5 city1) 622)
	(= (distance city5 city2) 504)
	(= (distance city5 city3) 648)
	(= (distance city5 city4) 661)
	(= (distance city5 city5) 0)
	(= (distance city5 city6) 570)
	(= (distance city5 city7) 616)
	(= (distance city6 city0) 642)
	(= (distance city6 city1) 909)
	(= (distance city6 city2) 986)
	(= (distance city6 city3) 604)
	(= (distance city6 city4) 515)
	(= (distance city6 city5) 570)
	(= (distance city6 city6) 0)
	(= (distance city6 city7) 664)
	(= (distance city7 city0) 606)
	(= (distance city7 city1) 570)
	(= (distance city7 city2) 562)
	(= (distance city7 city3) 761)
	(= (distance city7 city4) 720)
	(= (distance city7 city5) 616)
	(= (distance city7 city6) 664)
	(= (distance city7 city7) 0)
	(= (total-fuel-used) 0)
)
(:goal (and
	(at plane1 city6)
	(at plane3 city7)
	(at person1 city1)
	(at person2 city7)
	(at person3 city1)
	(at person4 city5)
	(at person5 city5)
	(at person6 city2)
	))

(:metric minimize (+ (* 3 (total-time))  (* 2 (total-fuel-used))))
)

; plan
1. (fly plane3 city2 city7)
   deleted: (at plane3 city2)
   added: (at plane3 city7)
   changed: (total-fuel-used) from 0 to 2810, (fuel plane3) from 4624 to 1814
   goals met: 1 of 8
2. (fly plane4 city5 city6)
   deleted: (at plane4 city5)
   added: (at plane4 city6)
   changed: (total-fuel-used) from 2810 to 5660, (fuel plane4) from 4847 to 1997
   goals met: 1 of 8
3. (refuel plane1 city3)
   changed: (fuel plane1) from 11 to 3019
   goals met: 1 of 8
4. (zoom plane1 city3 city6)
   deleted: (at plane1 city3)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 5660 to 6868, (fuel plane1) from 3019 to 1811
   goals met: 2 of 8
5. (fly plane2 city7 city1)
   deleted: (at plane2 city7)
   added: (at plane2 city1)
   changed: (total-fuel-used) from 6868 to 7438, (fuel plane2) from 725 to 155
   goals met: 2 of 8
6. (board person5 plane1 city6)
   deleted: (at person5 city6)
   added: (in person5 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 2 of 8
7. (board person2 plane5 city0)
   deleted: (at person2 city0)
   added: (in person2 plane5)
   changed: (onboard plane5) from 0 to 1
   goals met: 2 of 8
8. (board person1 plane1 city6)
   deleted: (at person1 city6)
   added: (in person1 plane1)
   changed: (onboard plane1) from 1 to 2
   goals met: 2 of 8
9. (fly plane1 city6 city4)
   deleted: (at plane1 city6)
   added: (at plane1 city4)
   changed: (total-fuel-used) from 7438 to 7953, (fuel plane1) from 1811 to 1296
   goals met: 1 of 8
10. (board person6 plane1 city4)
   deleted: (at person6 city4)
   added: (in person6 plane1)
   changed: (onboard plane1) from 2 to 3
   goals met: 1 of 8
11. (fly plane5 city0 city7)
   deleted: (at plane5 city0)
   added: (at plane5 city7)
   changed: (total-fuel-used) from 7953 to 10983, (fuel plane5) from 4944 to 1914
   goals met: 1 of 8
12. (board person3 plane1 city4)
   deleted: (at person3 city4)
   added: (in person3 plane1)
   changed: (onboard plane1) from 3 to 4
   goals met: 1 of 8
13. (fly plane1 city4 city5)
   deleted: (at plane1 city4)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 10983 to 11644, (fuel plane1) from 1296 to 635
   goals met: 1 of 8
14. (debark person2 plane5 city7)
   deleted: (in person2 plane5)
   added: (at person2 city7)
   changed: (onboard plane5) from 1 to 0
   goals met: 2 of 8
15. (debark person5 plane1 city5)
   deleted: (in person5 plane1)
   added: (at person5 city5)
   changed: (onboard plane1) from 4 to 3
   goals met: 3 of 8
16. (fly plane1 city5 city2)
   deleted: (at plane1 city5)
   added: (at plane1 city2)
   changed: (total-fuel-used) from 11644 to 12148, (fuel plane1) from 635 to 131
   goals met: 3 of 8
17. (debark person6 plane1 city2)
   deleted: (in person6 plane1)
   added: (at person6 city2)
   changed: (onboard plane1) from 3 to 2
   goals met: 4 of 8
18. (refuel plane1 city2)
   changed: (fuel plane1) from 131 to 3019
   goals met: 4 of 8
19. (fly plane1 city2 city1)
   deleted: (at plane1 city2)
   added: (at plane1 city1)
   changed: (total-fuel-used) from 12148 to 13047, (fuel plane1) from 3019 to 2120
   goals met: 4 of 8
20. (debark person1 plane1 city1)
   deleted: (in person1 plane1)
   added: (at person1 city1)
   changed: (onboard plane1) from 2 to 1
   goals met: 5 of 8
21. (debark person3 plane1 city1)
   deleted: (in person3 plane1)
   added: (at person3 city1)
   changed: (onboard plane1) from 1 to 0
   goals met: 6 of 8
22. (board person4 plane1 city1)
   deleted: (at person4 city1)
   added: (in person4 plane1)
   changed: (onboard plane1) from 0 to 1
   goals met: 6 of 8
23. (fly plane1 city1 city5)
   deleted: (at plane1 city1)
   added: (at plane1 city5)
   changed: (total-fuel-used) from 13047 to 13669, (fuel plane1) from 2120 to 1498
   goals met: 6 of 8
24. (debark person4 plane1 city5)
   deleted: (in person4 plane1)
   added: (at person4 city5)
   changed: (onboard plane1) from 1 to 0
   goals met: 7 of 8
25. (zoom plane1 city5 city6)
   deleted: (at plane1 city5)
   added: (at plane1 city6)
   changed: (total-fuel-used) from 13669 to 14809, (fuel plane1) from 1498 to 358
   goals met: 8 of 8
